# Question 8

Write SQL queries on the below database table that return:
a) All the temperature data.
b) All the cities, but without repetition.
c) All the records for India.
d) All the Fall records.
e) The city, country, and season for which the average rainfall is between 200
and 400 millimeters.
f) The city and country for which the average Fall temperature is above 20
degrees, in increasing temperature order.
g) The total annual rainfall for Cairo.
h) The total rainfall for each season.
City Country Season Temperature
(C)
Rainfall
(mm)
Mumbai India Winter 24.8 5.9
Mumbai India Spring 28.4 16.2
Mumbai India Summer 27.9 1549.4
Mumbai India Fall 27.6 346.0
London United Kingdom Winter 4.2 207.7
London United Kingdom Spring 8.3 169.6
London United Kingdom Summer 15.7 157.0
London United Kingdom Fall 10.4 218.5
Cairo Egypt Winter 13.6 16.5
Cairo Egypt Spring 20.7 6.5
Cairo Egypt Summer 27.7 0.1
Cairo Egypt Fall 22.2 4.5

In [13]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%sql sqlite://

In [31]:
%%sql
CREATE TABLE Records(City varchar(50), Country varchar(50), Season varchar(50), Temperature int, Rainfall int);
INSERT INTO Records VALUES
('Mumbai','India', 'Winter',24.8,5.9),
('Mumbai','India', 'Spring',28.8,16.2),
('Mumbai','India', 'Summer',27.9,1549.4),
('Mumbai','India', 'Fall',27.6,346.0 ),
('London','United Kingdom','Winter',4.2,207.7 ),
('London','United Kingdom','Spring',8.3,169.6 ),
('London','United Kingdom','Summer', 15.7,157.0),
('London','United Kingdom','Fall', 10.4,218.5),
('Cairo','Egypt','Winter', 13.6,16.5),
('Cairo','Egypt','Spring', 20.7,6.5),
('Cairo','Egypt','Summer',27.7,0.1),
('Cairo','Egypt','Fall', 22.2,4.5);
select * from Records;

 * sqlite://
(sqlite3.OperationalError) table Records already exists
[SQL: CREATE TABLE Records(City varchar(50), Country varchar(50), Season varchar(50), Temperature int, Rainfall int);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### ***a) All the temperature data.***

In [32]:
%sql SELECT Temperature FROM Records;

 * sqlite://
Done.

[(24.8,),
 (28.8,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

### ***b) All the cities, but without repetition.***

In [33]:
%sql SELECT DISTINCT City FROM Records;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

### ***c) All the records for India.***

In [34]:
%sql SELECT * FROM Records WHERE Country = 'India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.8, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346)]

### ***d) All the Fall records.***

In [35]:
%sql SELECT * FROM Records WHERE Season = 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

### ***e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters.***

In [36]:
%sql SELECT City, Country, Season FROM Records WHERE Rainfall BETWEEN 200 And 400;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

### ***f) The city and country for which the average Fall temperature is above 20 degrees, in increasing     temperature order.***

In [37]:
%sql SELECT City, Country FROM Records WHERE Season = 'Fall' AND Temperature >20 ORDER BY Temperature ASC;

 * sqlite://
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

### ***g) The total annual rainfall for Cairo.***

In [38]:
%sql SELECT Sum(Rainfall) as Total_Annual_Rainfall FROM Records WHERE City='Cairo';

 * sqlite://
Done.

[(27.6,)]

### ***h) The total rainfall for each season.***

In [39]:
%sql SELECT Season, round(Sum(Rainfall),1) as Total_Rainfall FROM Records GROUP BY Season;

 * sqlite://
Done.

[('Fall', 569.0), ('Spring', 192.3), ('Summer', 1706.5), ('Winter', 230.1)]